In [1]:
import numpy as np
import pandas as pd

importing required libraries

In [2]:
cust= pd.read_csv("customers.csv")
prod= pd.read_csv("products.csv")
trans= pd.read_csv("transactions.csv")

Reading the Data given

In [3]:
print("Customer:", cust.shape)
print("Products:", prod.shape)
print("Transaction:", trans.shape)

Customer: (2000, 6)
Products: (150, 5)
Transaction: (10015, 7)

Shape of each Dataset

In [4]:
print("Customer:\n", cust.dtypes)
print("\nProduct:\n", prod.dtypes)
print("\nTransaction:\n", trans.dtypes)

Customer:
 customer_id        int64
customer_name     object
email             object
signup_date       object
country           object
age              float64
dtype: object

Product:
 product_id        int64
product_name     object
category         object
supplier_id       int64
cost_price      float64
dtype: object

Transaction:
 transaction_id      int64
customer_id         int64
product_id          int64
quantity          float64
price             float64
timestamp          object
payment_method     object
dtype: object

Data type of each coloumn in each dataset
issue in Data type of dates in every coloumn

In [5]:
cust.head(3)

,customer_id,customer_name,email,signup_date,country,age
0,1,Customer41,customer410@yahoo.com,2022-01-28,UK,30.0
1,2,Custome41,custome411@email.com,2023-10-28,Mexico,29.0
2,3,customer41,customer412@email.com,2023-04-05,Australia,69.0

In [6]:
prod.head(3)

   product_id   product_name category  supplier_id  cost_price
0           1  Product_OFF_0     Toys           28      113.16
1           2  Product_SPO_1    Books           43      166.06
2           3  Product_SPO_2    Books           47      128.13

In [7]:
trans.head(3)

,transaction_id,customer_id,product_id,quantity,price,timestamp,payment_method
0,4292,130,89,1.0,112.87,2024-08-17 09:13:00,Credit Card
1,9107,271,98,1.0,211.90,2023-11-17 20:50:00,PayPal
2,7842,66,33,1.0,225.04,2023-03-21 23:23:00,Bank Transfer

3 head row of each dataset

In [8]:
cust['signup_date'] = pd.to_datetime(cust['signup_date'], errors='coerce')
trans['timestamp'] = pd.to_datetime(trans['timestamp'], errors='coerce')
trans['quantity'] = trans['quantity'].astype('Int64')

Converted date and quantity columns to correct data types

In [9]:
cust.isnull().sum()

customer_id        0
customer_name      0
email             53
signup_date        0
country            0
age              100
dtype: int64

In [10]:
prod.isnull().sum()

product_id      0
product_name    0
category        3
supplier_id     0
cost_price      0
dtype: int64

In [11]:
trans.isnull().sum()

transaction_id      0
customer_id         0
product_id          0
quantity           97
price             102
timestamp           0
payment_method    101
dtype: int64

Column having null values in each dataset

In [12]:
trans['transaction_id'].duplicated().sum()

np.int64(15)

Number of duplicate transaction_id entries

In [13]:
print("earliest transaction:",trans['timestamp'].min())
print("latest transaction:",trans['timestamp'].max())

earliest transaction: 2023-01-01 00:39:00
latest transaction: 2024-12-31 22:18:00

earlist and latest transactions

In [14]:
trans['hour'] = trans['timestamp'].dt.hour
trans['day_of_week'] = trans['timestamp'].dt.day_name()
trans['month'] = trans['timestamp'].dt.month_name()
trans.head()

,transaction_id,customer_id,product_id,quantity,price,timestamp,payment_method,hour,day_of_week,month
0,4292,130,89,1,112.87,2024-08-17 09:13:00,Credit Card,9,Saturday,August
1,9107,271,98,1,211.90,2023-11-17 20:50:00,PayPal,20,Friday,November
2,7842,66,33,1,225.04,2023-03-21 23:23:00,Bank Transfer,23,Tuesday,March
3,3485,432,73,1,72.20,2024-11-18 17:04:00,Cash,17,Monday,November
4,8929,248,11,1,315.22,2024-09-14 19:19:00,Cash,19,Saturday,September

Extracting the following Hour of day, Day of week, Month

In [15]:
cust['email'].fillna(cust['email'].mode()[0], inplace=True)
prod['category'].fillna(prod['category'].mode()[0], inplace=True)
trans['payment_method'].fillna(trans['payment_method'].mode()[0], inplace=True)

C:\Users\asaad\AppData\Local\Temp\ipykernel_16904\4217837890.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cust['email'].fillna(cust['email'].mode()[0], inplace=True)
C:\Users\asaad\AppData\Local\Temp\ipykernel_16904\4217837890.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  prod['category'].fillna(prod['category'].mode()[0], inplace=True)
C:\Users\asaad\AppData\Local\Temp\ipykernel_16904\4217837890.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  trans['payment_method'].fillna(trans['payment_method'].mode()[0], inplace=True)

replacing the empty catagorical value with mode

In [16]:
cust['age'].fillna(cust['age'].median(), inplace=True)
trans['price'].fillna(trans['price'].median(), inplace=True)
trans['quantity'].fillna(trans['quantity'].median(), inplace=True)

C:\Users\asaad\AppData\Local\Temp\ipykernel_16904\801055598.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cust['age'].fillna(cust['age'].median(), inplace=True)
C:\Users\asaad\AppData\Local\Temp\ipykernel_16904\801055598.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  trans['price'].fillna(trans['price'].median(), inplace=True)
C:\Users\asaad\AppData\Local\Temp\ipykernel_16904\801055598.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  trans['quantity'].fillna(trans['quantity'].median(), inplace=True)

replacing the empty numerical value with median

In [17]:
trans['revenue'] = trans['price'] * trans['quantity']

Revenue calculation

In [18]:
full_data = trans.merge(cust, on='customer_id', how='left')

In [19]:
full_data = full_data.merge(prod, on='product_id', how='left')

In [20]:
full_data.head(3)

,transaction_id,customer_id,product_id,quantity,price,timestamp,payment_method,hour,day_of_week,month,revenue,customer_name,email,signup_date,country,age,product_name,category,supplier_id,cost_price
0,4292,130,89,1,112.87,2024-08-17 09:13:00,Credit Card,9,Saturday,August,112.87,Customer_129,customer_129129@yahoo.com,2023-12-20,Canada,40.0,Product_HOM_88,Books,2,59.72
1,9107,271,98,1,211.90,2023-11-17 20:50:00,PayPal,20,Friday,November,211.9,Customer_270,customer_270270@email.com,2022-11-09,India,21.0,Product_BOO_97,Home & Garden,26,84.89
2,7842,66,33,1,225.04,2023-03-21 23:23:00,Bank Transfer,23,Tuesday,March,225.04,Customer_65,customer_6565@email.com,2023-08-08,Canada,62.0,Product_BOO_32,Electronics,22,103.61

merging the the data frame

In [21]:
full_data['profit_margin'] = (full_data['price'] - full_data['cost_price'])/full_data['price']*100

calculation of profit margin

In [22]:
full_data.head()

,transaction_id,customer_id,product_id,quantity,price,timestamp,payment_method,hour,day_of_week,month,...,customer_name,email,signup_date,country,age,product_name,category,supplier_id,cost_price,profit_margin
0,4292,130,89,1,112.87,2024-08-17 09:13:00,Credit Card,9,Saturday,August,...,Customer_129,customer_129129@yahoo.com,2023-12-20,Canada,40.0,Product_HOM_88,Books,2,59.72,47.089572
1,9107,271,98,1,211.90,2023-11-17 20:50:00,PayPal,20,Friday,November,...,Customer_270,customer_270270@email.com,2022-11-09,India,21.0,Product_BOO_97,Home & Garden,26,84.89,59.938650
2,7842,66,33,1,225.04,2023-03-21 23:23:00,Bank Transfer,23,Tuesday,March,...,Customer_65,customer_6565@email.com,2023-08-08,Canada,62.0,Product_BOO_32,Electronics,22,103.61,53.959296
3,3485,432,73,1,72.20,2024-11-18 17:04:00,Cash,17,Monday,November,...,Customer_431,customer_431431@gmail.com,2023-10-29,India,64.0,Product_OFF_72,Home & Garden,31,39.53,45.249307
4,8929,248,11,1,315.22,2024-09-14 19:19:00,Cash,19,Saturday,September,...,Customer_247,customer_247247@company.com,2022-09-15,Mexico,64.0,Product_TOY_10,Clothing,14,127.00,59.710678

New Data Frame

In [23]:
cust_revenue = full_data.groupby('customer_id')['revenue'].sum().reset_index()
cust_revenue.head()

   customer_id   revenue
0            1   1424.99
1            2    641.99
2            3  11180.42
3            4   4383.63
4            5   1920.98

In [24]:
cust_trans_count = full_data.groupby('customer_id')['transaction_id'].nunique().reset_index()
cust_trans_count.head()

   customer_id  transaction_id
0            1               5
1            2               3
2            3              30
3            4               8
4            5               5

In [25]:
cust_avg_value = full_data.groupby('customer_id')['revenue'].mean().reset_index()
cust_avg_value.head()

   customer_id     revenue
0            1     284.998
1            2  213.996667
2            3  372.680667
3            4   547.95375
4            5     384.196

In [26]:
counts = full_data.groupby(['customer_id', 'category']).size().reset_index(name='prch_count')
top_idx = counts.groupby('customer_id')['prch_count'].idxmax()
cust_top_category = counts.loc[top_idx, ['customer_id', 'category']].rename(columns={'category': 'most_frequent_category'})
cust_top_category.head()

    customer_id most_frequent_category
1             1        Food & Beverage
4             2        Food & Beverage
5             3             Automotive
9             4                  Books
12            5                 Sports

In [27]:
cust_revenue.rename(columns={'revenue': 'total_revenue'}, inplace=True)
cust_trans_count.rename(columns={'transaction_id': 'No_trans'}, inplace=True)
cust_avg_value.rename(columns={'revenue': 'avg_trans_value'}, inplace=True)

In [28]:
customer_summary = (
    cust_revenue
    .merge(cust_trans_count, on='customer_id', how='left')
    .merge(cust_avg_value, on='customer_id', how='left')
    .merge(cust_top_category, on='customer_id', how='left')
)
customer_summary.head()

,customer_id,total_revenue,No_trans,avg_trans_value,most_frequent_category
0,1,1424.99,5,284.998,Food & Beverage
1,2,641.99,3,213.996667,Food & Beverage
2,3,11180.42,30,372.680667,Automotive
3,4,4383.63,8,547.95375,Books
4,5,1920.98,5,384.196,Sports

In [29]:
full_data['month_period'] = full_data['timestamp'].dt.to_period('M')

In [30]:
monthly_summary = (
    full_data.groupby('month_period')
    .agg(
        total_revenue=('revenue', 'sum'),
        unique_customers=('customer_id', 'nunique'),
        avg_order_value=('revenue', 'mean')
    )
    .reset_index()
)
monthly_summary.head()

  month_period  total_revenue  unique_customers  avg_order_value
0      2023-01  193405.812589               349       398.774871
1      2023-02  165296.517903               313       387.111283
2      2023-03  183939.273323               341       399.867985
3      2023-04  183610.501489               359       385.736348
4      2023-05   195409.94589               344       433.281476

In [31]:
monthly_summary['month_period'] = monthly_summary['month_period'].astype(str)
monthly_summary['month'] = pd.to_datetime(monthly_summary['month_period'])
monthly_summary = monthly_summary.sort_values('month').reset_index(drop=True)
monthly_summary.head()

  month_period  total_revenue  unique_customers  avg_order_value      month
0      2023-01  193405.812589               349       398.774871 2023-01-01
1      2023-02  165296.517903               313       387.111283 2023-02-01
2      2023-03  183939.273323               341       399.867985 2023-03-01
3      2023-04  183610.501489               359       385.736348 2023-04-01
4      2023-05   195409.94589               344       433.281476 2023-05-01

In [32]:
monthly_summary['mom_growth_%'] = monthly_summary['total_revenue'].pct_change() * 100
monthly_summary.head()

,month_period,total_revenue,unique_customers,avg_order_value,month,mom_growth_%
0,2023-01,193405.812589,349,398.774871,2023-01-01,<NA>
1,2023-02,165296.517903,313,387.111283,2023-02-01,-14.533842
2,2023-03,183939.273323,341,399.867985,2023-03-01,11.278372
3,2023-04,183610.501489,359,385.736348,2023-04-01,-0.178739
4,2023-05,195409.94589,344,433.281476,2023-05-01,6.426345

In [33]:
product_summary = (
    full_data.groupby(['product_id', 'product_name', 'category'])
    .agg(
        total_revenue=('revenue', 'sum'),
        total_quantity=('quantity', 'sum'),
        avg_profit_margin=('profit_margin', 'mean')
    )
    .reset_index()
)
product_summary.head()

,product_id,product_name,category,total_revenue,total_quantity,avg_profit_margin
0,1,Product_OFF_0,Toys,23053.23,106,45.398480
1,2,Product_SPO_1,Books,38709.331798,836,-154.646423
2,3,Product_SPO_2,Books,28095.032039,655,-13.094320
3,4,Product_FOO_3,Toys,37413.03,130,42.117000
4,5,Product_BOO_4,Books,25642.33,118,43.466166

In [36]:
top_by_revenue = product_summary.nlargest(10, 'total_revenue')
display(top_by_revenue)

,product_id,product_name,category,total_revenue,total_quantity,avg_profit_margin
97,101,Product_OFF_100,Automotive,95005.12,431,42.570323
58,60,Product_OFF_59,Office,78366.194739,1115,-28.056624
46,48,Product_OFF_47,Clothing,71998.077896,542,-15.166955
112,116,Product_CLO_115,Electronics,66416.407761,1209,-423.012763
89,92,Product_ELE_91,Home & Garden,65408.5,182,42.517918
121,125,Product_AUT_124,Food & Beverage,56546.750931,617,-10.584249
73,75,Product_ELE_74,Home & Garden,55931.4,160,41.706567
114,118,Product_AUT_117,Electronics,55178.95,215,46.104987
104,108,Product_OFF_107,Office,54293.74,162,43.971692
7,8,Product_TOY_7,Electronics,52609.01,250,43.239548

In [37]:
top_by_quantity = product_summary.nlargest(10, 'total_quantity')
display(top_by_quantity)

,product_id,product_name,category,total_revenue,total_quantity,avg_profit_margin
39,41,Product_SPO_40,Books,12267.912999,1751,31.836810
36,38,Product_SPO_37,Toys,35250.288965,1475,-226.883944
37,39,Product_BOO_38,Food & Beverage,36993.146321,1252,-69.795111
112,116,Product_CLO_115,Electronics,66416.407761,1209,-423.012763
128,132,Product_BOO_131,Sports,37658.621558,1133,-19.514640
26,28,Product_HOM_27,Clothing,43135.583228,1122,-32.762244
127,131,Product_HOM_130,Home & Garden,26517.363563,1118,-13.577050
58,60,Product_OFF_59,Office,78366.194739,1115,-28.056624
45,47,Product_AUT_46,Toys,7826.665592,1106,29.267339
14,15,Product_BOO_14,Sports,34181.890967,992,-92.233456

In [38]:
top_by_profit_margin = product_summary.nlargest(10, 'avg_profit_margin')
display(top_by_profit_margin)

,product_id,product_name,category,total_revenue,total_quantity,avg_profit_margin
117,121,Product_AUT_120,Beauty,8185.02,114,48.587045
83,86,Product_OFF_85,Toys,25423.32,128,47.394337
85,88,Product_CLO_87,Toys,5096.55,134,47.035482
100,104,Product_ELE_103,Home & Garden,24525.85,148,46.875853
20,21,Product_TOY_20,Toys,21573.64,124,46.346305
114,118,Product_AUT_117,Electronics,55178.95,215,46.104987
79,82,Product_OFF_81,Books,8204.31,105,45.846472
81,84,Product_BOO_83,Toys,29955.75,116,45.717587
136,140,Product_FOO_139,Automotive,3253.6,148,45.642149
137,141,Product_BEA_140,Books,18838.93,129,45.570574